app/controllers/docs_controller.rb

  def index
    # @docs = Doc.all
    @docs = if params[:s].present?
      Doc.search(params[:s])
---
SELECT * FROM "docs"

  def show
    @doc = Doc.find(params[:id])
---
SELECT * FROM "docs" WHERE ("docs"."id" = 1)

  def edit
    @doc = Doc.find(params[:id])
---
SELECT * FROM "docs" WHERE ("docs"."id" = 1)

  def create
    @doc = Doc.new(params[:doc])

    respond_to do |format|
      if @doc.save
---
INSERT INTO "docs" ("created_at", "title", "updated_at", "text") VALUES('2010-06-05 20:34:10', 'aaaaaa', '2010-06-05 20:34:10', '<p onclick="alert(''foo'')">hoge</p>

  def update
    @doc = Doc.find(params[:id])

    respond_to do |format|
      if @doc.update_attributes(params[:doc])
---
SELECT * FROM "docs" WHERE ("docs"."id" = 1)
UPDATE "docs" SET "updated_at" = '2010-06-07 15:05:40', "text" = '<a href="http://www.flickr.com/photos/hogewest/4671419992/" title="100417_1345~0001 by hogewest, on Flickr"><img src="http://farm5.static.flickr.com/4070/4671419992_7775cec865.jpg" width="240" height="320" alt="100417_1345~0001" /></a>

  def destroy
    @doc = Doc.find(params[:id])
    @doc.destroy
---
SELECT * FROM "docs" WHERE ("docs"."id" = 2)
DELETE FROM "docs" WHERE "id" = 2